trade_exp/src/Documents/СписаниеНедостачТоваров/СписаниеНедостачТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СписаниеНедостачТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПересчетТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2a759476-634c-49ca-98f6-188e8168647e">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b233622f-e90f-48dd-9caf-289bb72dd238">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Кладовщик</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="80f88656-3c34-46f6-be0d-e204c50e6846">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ИсточникиИнформацииОЦенахДляПечати/ИсточникиИнформацииОЦенахДляПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ИсточникиИнформацииОЦенахДляПечати</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПоСебестоимости</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоВидуЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыДействияВидовЦен/СтатусыДействияВидовЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДействияВидовЦен</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e2decfa9-b21b-4b8e-9bae-aa344ce05ffe">
    <name>НеДействует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/СписаниеНедостачТоваров/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПодстановкаДанных()
	
   Если ЗначениеЗаполнено(Объект.Склад) Тогда 
   	
    	Объект.Подразделение = Объект.Склад.Подразделение;
    	Объект.АналитикаРасходов = Объект.Склад.Подразделение;
    	
    КонецЕсли;
    
КонецПроцедуры





//Зеленение
&После("УстановитьУсловноеОформление")
Процедура Спр_УстановитьУсловноеОформление()
	АльтерраОбщегоНазначения.УстановитьОформлениеЗеленениеСтрокТабличныхЧастей(ЭтаФорма,"Товары");
КонецПроцедуры

&НаСервере
Процедура СКПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
Элементы.ИсключитьИзКонтроля.Доступность= РольДоступна("РазрешитьИсключатьДокументыИзКонтроляОрдерногоУчета");

	ЭтаФорма.Элементы._ГруппаСекции.Видимость=рольДоступна("ПолныеПрава") или рольДоступна("СнятьЗеленение");
    НастройкаОтображенияКомандыСозданияОрдеров();
	
	///////Задача https://bitrix.tg-alterra.ru/company/personal/user/1794/tasks/task/view/164929/
	ЭлементПодразделение = ЭтаФорма.Элементы.Подразделение;
	ЭлементСклад = ЭтаФорма.Элементы.Склад;
	ЭтаФорма.Элементы.Переместить(ЭлементПодразделение, ЭлементСклад.Родитель, ЭлементСклад);
	//////      
	
	Если Объект.ИсточникИнформацииОЦенахДляПечати.Пустая() Тогда
		Объект.ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоСебестоимости;
		Элементы.ВидЦены.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура СброситьПоСекции(Команда)
	МассивВыдСтрок=Элементы.Товары.ВыделенныеСтроки;
	если МассивВыдСтрок.Количество()<>0 тогда
		Для Каждого ТекСтрока Из МассивВыдСтрок Цикл
			СтрокаКоллекции=Объект.Товары.НайтиПоИдентификатору(ТекСтрока);
			СтрокаКоллекции.Кладовщик="";
		конеццикла;
	конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура СКТоварыПередУдалениемПосле(Элемент, Отказ)
			если ЗначениеЗаполнено(Элементы.товары.ТекущиеДанные.Кладовщик) тогда
		Предупреждение("Товар выдан со склада. Удаление строки запрещено!!!");
		Отказ=Истина;
	конецесли;	

КонецПроцедуры

&НаКлиенте
Процедура СКТоварыПередНачаломИзмененияПосле(Элемент, Отказ)
	  		если ЗначениеЗаполнено(Элементы.товары.ТекущиеДанные.Кладовщик) тогда
		Предупреждение("Товар выдан со склада. Изменение строки запрещено!!!");
		Отказ=Истина;
	конецесли;	

КонецПроцедуры

#Область Доработки_по_ордерной_схеме

&НаСервере
Процедура НастройкаОтображенияКомандыСозданияОрдеров()
	
	ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач = 
	СкладыСервер.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач(Объект.Склад, Объект.Дата); 
	
	Если ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда
		ЭтаФорма.Элементы.Форма_СоздатьОрдера.Видимость = ?(ЗначениеЗаполнено(Объект.ПересчетТоваров) Или ЗначениеЗаполнено(Объект.ДокументОснование) ИЛИ ЗначениеЗаполнено(Объект.Основание),Ложь,Истина);
	Иначе
		ЭтаФорма.Элементы.Форма_СоздатьОрдера.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Док__СоздатьОрдераПослеНаСервере()
	Альтерра_СкладСервер.СоздатьОрдераПоАктам(Объект.Ссылка);	
КонецПроцедуры

&НаКлиенте
Процедура Док__СоздатьОрдераПосле(Команда)
	Док__СоздатьОрдераПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Док_СкладПриИзмененииПосле(Элемент)
	НастройкаОтображенияКомандыСозданияОрдеров();
	ПодстановкаДанных();	
КонецПроцедуры

&НаКлиенте
Процедура Док_ДатаПриИзмененииПосле(Элемент)
	НастройкаОтображенияКомандыСозданияОрдеров();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Док__ЗагрузитьИзФайла_АльтерраПосле(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайлаКлиент", ЭтотОбъект);
	ПараметрыФормы= Новый Структура();
	ПараметрыФормы.Вставить("НастройкиТаблицы",СтруктураТаблицы());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Функция СтруктураТаблицы()
	
	СтруктураТаблицы=Новый Структура();
	
	СтруктураТаблицы.Вставить("Код","строка#Код#15#1#Справочники.Номенклатура.НайтиПоКоду(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Номенклатура","СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Характеристика","строка#Характеристика#20");
	СтруктураТаблицы.Вставить("Количество","число#Количество#15");
	
	возврат  СтруктураТаблицы;
КонецФункции 

&НаКлиенте
Процедура ПослеЗагрузкиИзФайлаКлиент (Результат, ДополнительныеПараметры) Экспорт
	ПослеЗагрузкиИзФайла(Результат, ДополнительныеПараметры);
КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайла(Результат, ДополнительныеПараметры)
	
	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		
		Если ТаблицаДанных<>Неопределено Тогда
			Объект.Товары.Загрузить(ТаблицаДанных);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#Область ВводНаОсновании

&НаСервере
Процедура СоздатьНовыйДокумент(ИмяДокумента, НовыйОбъект)
	Документы[ИмяДокумента].ЗаполнитьДанныеПоОснованию(Объект.Ссылка, НовыйОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Док__ВводНаОснованииПропуск(Команда)
	
	ИмяДокумента = "Пропуск";
	ФормаДок = ПолучитьФорму("Документ." +  ИмяДокумента + ".ФормаОбъекта");
	
	//Далее мы получаем объект только, что созданной формы и помещаем её в переменную
	//В объекте содержатся все реквизиты (элементы) формы
	ДанныеФормы = ФормаДок.Объект;
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Данные еще не записаны.
		|Выполнение действия ""%1"" возможно только после записи данных.'"),
		"Реализация товаров и услуг");
		
		ПоказатьПредупреждение( , ТекстВопроса);
		Возврат;	
	КонецЕсли;
	
	//Мы помещаем объект формы в переменную,
	//так как должны передать её в процедуру на сервере,
	//где нельзя изменять объект формы, зато можно править переменную содержащую его
	СоздатьНовыйДокумент(ИмяДокумента, ДанныеФормы);
	
	//После выполнения процедуры на сервере мы получаем изменную переменную ДанныеФормы,
	//которую необходимо передать в уже созданную нами форму
	КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
	
	//Открываем результат выполнения обработки
	ФормаДок.Открыть();	

	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	НовыйМассив = Новый Массив();
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Статус", ПредопределенноеЗначение("Перечисление.СтатусыДействияВидовЦен.Действует"));
	НовыйМассив.Добавить(НовыйПараметр);
	НовыйПараметр2 = Новый ПараметрВыбора("Отбор.ИспользоватьПриПродаже", Ложь);
	НовыйМассив.Добавить(НовыйПараметр2);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ВидЦены.ПараметрыВыбора = НовыеПараметры;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьВидимостьВидЦены")
Процедура Док_УстановитьВидимостьВидЦены(ИсточникИнформацииОЦенахДляПечати)

	Если ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоВидуЦен Тогда
		Элементы.ВидЦены.Доступность = Истина;
#Удаление
	ИначеЕсли ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоСебестоимости Тогда
		Элементы.ВидЦены.Доступность = Ложь;
	КонецЕсли;
#КонецУдаления
#Вставка   
  Элементы.ВидЦены.Видимость = Истина;
ИначеЕсли ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоСебестоимости или
ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоЦенамПоставщиков  Тогда
		Элементы.ВидЦены.Видимость = Ложь;
	КонецЕсли;

#КонецВставки

КонецПроцедуры

#КонецОбласти
